In [4]:
import pandas as pd

In [42]:
friend_list = [
    ['Bang',22,'student'],
    ['Kim',21,'student'],
    ['Lee',22,'student'],
    ['Lim',21]
    ]

In [43]:
c_name = ['name','age','job']

In [44]:
df = pd.DataFrame.from_records(friend_list,columns= c_na me)

In [45]:
# create csv file
    # df.to_csv('friend_list.csv', index = False,na_rep='None')

In [46]:
df

   name  age      job
0  Bang   22  student
1   Kim   21  student
2   Lee   22  student
3   Lim   21     None

In [52]:
df.loc[[0,1]]

   name  age      job
0  Bang   22  student
1   Kim   21  student

In [54]:
df[df.age>21]

   name  age      job
0  Bang   22  student
2   Lee   22  student

In [56]:
df[(df.age>21) & (df.name == 'Bang')]

   name  age      job
0  Bang   22  student

In [58]:
df.iloc[1:3,0:2]

   name  age
0  Bang   22
1   Kim   21
2   Lee   22
3   Lim   21

In [62]:
df2 = pd.read_csv('friend_list.csv')

In [66]:
df_filter = df2[['name','job']]

In [68]:
df2.filter(items = ['name','age'])

   name  age
0  Bang   22
1   Kim   21
2   Lee   22
3   Lim   21

In [73]:
df.drop([0,1], inplace = True)

In [74]:
 df

  name  age      job
2  Lee   22  student
3  Lim   21     None